## set_index, reindex and reset_index method

```
set_index(): ম্যাথড ব্যবহার করে ডেটা ফ্রেমের কোন একটা কলামকে ঐ ডেটা ফ্রেমের ইনডেক্স হিসেবে ব্যবহার করা যায়।  

reset_index(): ম্যাথড ব্যবহার করে ডেটা ফ্রেমের সেট করা ইনডেক্সকে রিসেট করা যায়। 

reindex(): ম্যাথড ব্যবহার করে ডেটা ফ্রেমের রোগুলোকে রি-এরেঞ্জ করা যায়

```

In [4]:
import pandas as pd

In [6]:
data = {
    'Column1': [1, 2, 3, 4],
    'Column2' : [4, 5, 6, 7],
    'Column3' : ['Mohammad', 'Emdadul', 'Hoque', 'Tareque']
    
}

df = pd.DataFrame(data)
df

   Column1  Column2   Column3
0        1        4  Mohammad
1        2        5   Emdadul
2        3        6     Hoque
3        4        7   Tareque

In [9]:
df.set_index('Column2')

         Column1   Column3
Column2
4              1  Mohammad
5              2   Emdadul
6              3     Hoque
7              4   Tareque

In [11]:
df.reset_index()

   index  Column1  Column2   Column3
0      0        1        4  Mohammad
1      1        2        5   Emdadul
2      2        3        6     Hoque
3      3        4        7   Tareque

In [14]:
data = {
    'Column1': [1, 2, 3, 4],
    'Column2' : [4, 5, 6, 7],
    'Column3' : ['Mohammad', 'Emdadul', 'Hoque', 'Tareque']
    
}

df1 = pd.DataFrame(data, index = ['a', 'b', 'c', 'd'])
df1

   Column1  Column2   Column3
a        1        4  Mohammad
b        2        5   Emdadul
c        3        6     Hoque
d        4        7   Tareque

In [16]:

df1 = pd.DataFrame(data, index = ['d', 'c', 'b', 'a'])
df1

   Column1  Column2   Column3
d        1        4  Mohammad
c        2        5   Emdadul
b        3        6     Hoque
a        4        7   Tareque

## iterrows and iteritems

In [24]:
for i, j in df.iterrows():
    print("=======\n")
    print(i, j)

=======

0 Column1           1
Column2           4
Column3    Mohammad
Name: 0, dtype: object
=======

1 Column1          2
Column2          5
Column3    Emdadul
Name: 1, dtype: object
=======

2 Column1        3
Column2        6
Column3    Hoque
Name: 2, dtype: object
=======

3 Column1          4
Column2          7
Column3    Tareque
Name: 3, dtype: object

In [28]:
for i, j in df1.items():
    print( j)
    print()

d    1
c    2
b    3
a    4
Name: Column1, dtype: int64

d    4
c    5
b    6
a    7
Name: Column2, dtype: int64

d    Mohammad
c     Emdadul
b       Hoque
a     Tareque
Name: Column3, dtype: object